"""
Задача:
-------
Напишите программу, которая запрашивает у пользователя ввод числа
и проверяет, является ли это число равным 10.
Если число равно 10, программа должна вывести "Число равно 10".
Если число не равно 10, программа должна вывести "Число не равно 10".

Требования:
-----------
1. Используйте оператор присваивания (=) для хранения введенного пользователем числа в переменной.
2. Используйте оператор сравнения (==) для проверки равенства числа 10.
3. Убедитесь, что вы выводите соответствующие сообщения в зависимости от результата проверки.

Пример выполнения:
------------------
    Введите число: 10
    Число равно 10

    Введите число: 5
    Число не равно 10
"""

# Write your solution here
