"""
Задача:
-------
Напишите программу на Python, которая запрашивает
у пользователя возраст и проверяет, попадает ли он в определённый диапазон.

Программа должна определить, находится ли введённый возраст в пределах от 3 до 6 лет включительно,
а также в пределах от 13 до 19 лет включительно.

Если возраст находится в диапазоне от 3 до 6, программа должна вывести "Вы ребёнок".
Если возраст находится в диапазоне от 13 до 19, программа должна вывести "Вы подросток".
Если возраст больше 19 программа должна вывести "Вы не попадаете ни в одну из категорий".

Примеры выполнения:
-------------------
    Введите ваш возраст: 4
    Вы ребёнок

    Введите ваш возраст: 15
    Вы подросток

    Введите ваш возраст: 25
    Вы не попадаете ни в одну из категорий

Требования:
-----------
1. Используйте оператор сравнения для проверки, попадает ли возраст в указанные диапазоны.
2. Применяйте возможность объединять операторы сравнения в цепочки (например, `3 <= age <= 6`).
3. Убедитесь, что программа правильно выводит соответствующие сообщения в зависимости от введённого возраста.
"""

# Write your solution here
