"""
Задача:
-------

Напишите программу, которая проверяет,
является ли введенное пользователем число четным или нечетным.

Используйте отступы для определения блока кода,
который выполняется при истинности условия.

Требования:
-----------
1. Запросите у пользователя ввод числа.
2. Используйте оператор `if` для проверки, является ли число четным (число делится на 2 без остатка).
3. Если число четное, выведите "Число четное".
4. Используйте оператор `else` для обработки случая, если число нечетное, и выведите "Число нечетное".
5. Убедитесь, что вы правильно используете отступы для определения блоков кода.

Примеры выполнения:
-------------------
    Введите число: 4
    Число четное

    Введите число: 7
    Число нечетное
"""

# Write your solution here
