"""
Задача:
-------
Напишите программу, которая запрашивает у пользователя ввод числа и проверяет,
является ли это число положительным или отрицательным.

Программа должна выводить соответствующее сообщение в зависимости от введенного значения:
Если число положительное, выведите "Число положительное".
Если число отрицательное, выведите "Число отрицательное".

Требования:
-----------
- Используйте оператор `if` для проверки, является ли число положительным.
- Используйте оператор `else` для проверки, является ли число отрицательным.

Примеры выполнения:
-------------------
  Введите число: 5
  Число положительное

  Введите число: -3
  Число отрицательное
"""

# Write your solution here

